/******************************************************************************

 (c) 2013 Gemalto M2M GmbH <wmSupport@gemalto.com>

 All Rights Reserved.

 Cinterion provides this source code under the GPL v2 License.
 The GPL v2 license is available at

 http://opensource.org/licenses/gpl-license.php

******************************************************************************/

#ifndef __MUX_INTERFACE_H
#define __MUX_INTERFACE_H

//////////////////////////////////////////////////////////////////////////////
// return codes of the interface functions
//////////////////////////////////////////////////////////////////////////////
enum {
    MUX_OK = 0,
    MUX_ERR_INVALID_PARAMETER,
    MUX_ERR_WRONG_DLCI,
    MUX_ERR_DLCI_NOT_CONNECTED,
    MUX_ERR_WRONG_POWER_CMD,
    MUX_ERR_GET_MEMORY_FAILED,
    MUX_ERR_REVISION,
    MUX_ERR_CLIENT_NOT_ALLOWED
};


//////////////////////////////////////////////////////////////////////////////
// Mux Protocol Callback Interface
// These functions have to be provided by the framework
//////////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////////
// This function has to allocate memory which is needed for a multiplex
// protocol instance.
//
// Parameters:
// dwUserData       The user parameter passed to the initial call of
//                  Mux_Register().
// dwSize           The size in bytes of the required memory block.
//
// Return:

//                  call of Dlci_Establish().
// dwDLCI           The number of the corresponding DLCI.
// dwLen            Not used yet.
//
// Return:
// None
//////////////////////////////////////////////////////////////////////////////
typedef void    ( *DLCI_SENDDATACONTINUE_cb )   ( DWORD hMuxInstance, DWORD dwUserData, DWORD dwDLCI, DWORD dwLen );


//////////////////////////////////////////////////////////////////////////////
// This function is the interface from the multiplex protocol to the connected
// framework to deliver received and decoded data to the corresponding
// multiplex channel. The framework must return the number of read bytes. If
// it is not able to process all delivered bytes (e.g. because internal
// buffers are full) the framework may return a value smaller than the given
// data size. In that case the multiplex protocol will not continue the
// delivering of received data until the framework has indicated that it is
// able to receive data again by a call to Dlci_ReceiveDataContinue(). If
// receiving of data is stalled automatic virtual flow control will be handled
// by the multiplex protocol if necessary without the need for the framework
// to care about that issue.
//
// Parameters:
// hMuxInstance     The handle returned by the initial call of Mux_Register()
//                  identifying the corresponding multiplex protocol instance.
// dwUserData       The DLCI specific user parameter passed to the initial
//                  call of Dlci_Establish().
// dwDLCI           The number of the corresponding DLCI.
// pData            The pointer to the received data.
// dwDataLen        The length in bytes of the received data to be handled.
// dwBytesInBuffer  The overall number of bytes currently in the dlci's
//                  receive buffer. This parameter is not required for the
//                  data handling and just passed for informational reasons.
//
// Return:
// The function has to return the number of read data from framework (a return
// value of 0 is possible).
//////////////////////////////////////////////////////////////////////////////
typedef DWORD   ( *DLCI_RECEIVEDATA_cb )        ( DWORD hMuxInstance, DWORD dwUserData, DWORD dwDLCI, PBYTE pData, DWORD dwDataLen, DWORD dwBytesInBuffer );


//////////////////////////////////////////////////////////////////////////////
// A call of this callback function indicates that a state change of the
// incoming virtual modem signals CTS, RING, CD or DSR has been received.
//
// Parameters:
// hMuxInstance     The handle returned by the initial call of Mux_Register()
//                  identifying the corresponding multiplex protocol instance.
// dwUserData       The DLCI specific user parameter passed to the initial
//                  call of Dlci_Establish().
// dwDLCI           The number of the corresponding DLCI.
// MuxV24Status     The V24 virtual status signals.
//
// Return:
// None
//////////////////////////////////////////////////////////////////////////////
typedef struct _mux_v24status
{
/*0*/  unsigned int DTR            : 1; // Status of the DTR signal
/*1*/  unsigned int RTS            : 1; // Status of the RTS signal
/*2*/  unsigned int OutFlowActive  : 1; // Status of the  outgoing flow control (1 means flow control active)
/*3*/  unsigned int Reserved_0     : 1;
/*4*/  unsigned int BreakInd       : 1; // Signals if the interface receives a break indication
/*5*/  unsigned int Reserved_1     : 1;
/*6*/  unsigned int Reserved_2     : 1;
/*7*/  unsigned int Reserved_3     : 1;
/*8*/  unsigned int CTS            : 1; // Status of the DTE signal
/*9*/  unsigned int DSR            : 1; // Status of the DSR signal
/*a*/  unsigned int RI             : 1; // Indicates a incoming call
/*b*/  unsigned int DCD            : 1; // Status of the DCD signal
/*c*/  unsigned int InFlowActive   : 1; // Status of the incoming flow control (1 means flow control active)
/*d*/  unsigned int BreakReq       : 1; // Break Request
/*e*/  unsigned int Reserved_4     : 1;
/*f*/  unsigned int TxEmpty        : 1; // Indicates that the send buffer is empty
/*0*/  unsigned int TxFull         : 1; // Indicates that the send buffer is full
} MUX_V24STATUS_t;

typedef void    ( *DLCI_RECEIVEV24STATUS_cb )   ( DWORD hMuxInstance, DWORD dwUserData, DWORD dwDLCI, MUX_V24STATUS_t MuxV24Status );


//////////////////////////////////////////////////////////////////////////////
// A call of this callback function signals abnormal abortion of the channel
// activity in case of a multiplex reset. The framework can use this
// information to reset the internal channel states and put the channel
// implementation into the initial state.
//
// Parameters:
// hMuxInstance     The handle returned by the initial call of Mux_Register()
//                  identifying the corresponding multiplex protocol instance.
// dwUserData       The DLCI specific user parameter passed to the initial
//                  call of Dlci_Establish().
// dwDLCI           The number of the corresponding DLCI.
//
// Return:
// None
